In [12]:
import pymysql
import pandas as pd

In [2]:
conn = pymysql.connect(
    host='localhost',
    user='root',
    password='Admin@123',
    db='python_project1'
)

In [3]:
cursor=conn.cursor()

In [5]:
cursor.execute('''
select * from census c
join housing h using (Stateorut,District)
join government_hospitals gh using (StateorUT)
join hospitals ah using (StateorUT)
order by c.StateorUT,District limit 3;
''')

3

In [6]:
s=cursor.fetchall()

In [13]:
data=pd.DataFrame(s)

In [14]:
data

,0,1,2,3,4,5,6,7,8,9,...,32,33,34,35,36,37,38,39,40,41
0,Andaman and Nicobar Islands,Nicobars,637,36842.0,20727.0,16115.0,25332.0,15397.0,9935.0,15958.0,...,1075,30,4,27,4,0,3,34,1246,380581
1,Andaman and Nicobar Islands,North AND Middle Andaman,638,105597.0,54861.0,50736.0,78683.0,43186.0,35497.0,39091.0,...,1075,30,4,27,4,0,3,34,1246,380581
2,Andaman and Nicobar Islands,South Andaman,639,238142.0,127283.0,110859.0,190266.0,105794.0,84472.0,34901.0,...,1075,30,4,27,4,0,3,34,1246,380581